RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_ioc.h
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PA0_SEL register.
//
//*****************************************************************************
#define IOC_PA0_SEL_PA0_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PA0. 
#define IOC_PA0_SEL_PA0_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PA1_SEL register.
//
//*****************************************************************************
#define IOC_PA1_SEL_PA1_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PA1. 
#define IOC_PA1_SEL_PA1_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PA2_SEL register.
//
//*****************************************************************************
#define IOC_PA2_SEL_PA2_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PA2. 
#define IOC_PA2_SEL_PA2_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PA3_SEL register.
//
//*****************************************************************************
#define IOC_PA3_SEL_PA3_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PA3. 
#define IOC_PA3_SEL_PA3_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PA4_SEL register.
//
//*****************************************************************************
#define IOC_PA4_SEL_PA4_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PA4. 
#define IOC_PA4_SEL_PA4_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PA5_SEL register.
//
//*****************************************************************************
#define IOC_PA5_SEL_PA5_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PA5. 
#define IOC_PA5_SEL_PA5_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PA6_SEL register.
//
//*****************************************************************************
#define IOC_PA6_SEL_PA6_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PA6. 
#define IOC_PA6_SEL_PA6_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PA7_SEL register.
//
//*****************************************************************************
#define IOC_PA7_SEL_PA7_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PA7. 
#define IOC_PA7_SEL_PA7_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PB0_SEL register.
//
//*****************************************************************************
#define IOC_PB0_SEL_PB0_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PB0. 
#define IOC_PB0_SEL_PB0_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PB1_SEL register.
//
//*****************************************************************************
#define IOC_PB1_SEL_PB1_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PB1. 
#define IOC_PB1_SEL_PB1_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PB2_SEL register.
//
//*****************************************************************************
#define IOC_PB2_SEL_PB2_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PB2. 
#define IOC_PB2_SEL_PB2_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PB3_SEL register.
//
//*****************************************************************************
#define IOC_PB3_SEL_PB3_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PB3. 
#define IOC_PB3_SEL_PB3_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PB4_SEL register.
//
//*****************************************************************************
#define IOC_PB4_SEL_PB4_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PB4. 
#define IOC_PB4_SEL_PB4_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PB5_SEL register.
//
//*****************************************************************************
#define IOC_PB5_SEL_PB5_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PB5. 
#define IOC_PB5_SEL_PB5_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PB6_SEL register.
//
//*****************************************************************************
#define IOC_PB6_SEL_PB6_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PB6. 
#define IOC_PB6_SEL_PB6_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PB7_SEL register.
//
//*****************************************************************************
#define IOC_PB7_SEL_PB7_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PB7. 
#define IOC_PB7_SEL_PB7_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PC0_SEL register.
//
//*****************************************************************************
#define IOC_PC0_SEL_PC0_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PC0. 
#define IOC_PC0_SEL_PC0_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PC1_SEL register.
//
//*****************************************************************************
#define IOC_PC1_SEL_PC1_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PC1. 
#define IOC_PC1_SEL_PC1_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PC2_SEL register.
//
//*****************************************************************************
#define IOC_PC2_SEL_PC2_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PC2. 
#define IOC_PC2_SEL_PC2_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PC3_SEL register.
//
//*****************************************************************************
#define IOC_PC3_SEL_PC3_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PC3. 
#define IOC_PC3_SEL_PC3_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PC4_SEL register.
//
//*****************************************************************************
#define IOC_PC4_SEL_PC4_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PC4. 
#define IOC_PC4_SEL_PC4_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PC5_SEL register.
//
//*****************************************************************************
#define IOC_PC5_SEL_PC5_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PC5. 
#define IOC_PC5_SEL_PC5_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PC6_SEL register.
//
//*****************************************************************************
#define IOC_PC6_SEL_PC6_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PC6. 
#define IOC_PC6_SEL_PC6_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PC7_SEL register.
//
//*****************************************************************************
#define IOC_PC7_SEL_PC7_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PC7. 
#define IOC_PC7_SEL_PC7_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PD0_SEL register.
//
//*****************************************************************************
#define IOC_PD0_SEL_PD0_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PD0. 
#define IOC_PD0_SEL_PD0_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PD1_SEL register.
//
//*****************************************************************************
#define IOC_PD1_SEL_PD1_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PD1. 
#define IOC_PD1_SEL_PD1_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PD2_SEL register.
//
//*****************************************************************************
#define IOC_PD2_SEL_PD2_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PD2. 
#define IOC_PD2_SEL_PD2_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PD3_SEL register.
//
//*****************************************************************************
#define IOC_PD3_SEL_PD3_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PD3. 
#define IOC_PD3_SEL_PD3_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PD4_SEL register.
//
//*****************************************************************************
#define IOC_PD4_SEL_PD4_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PD4. 
#define IOC_PD4_SEL_PD4_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PD5_SEL register.
//
//*****************************************************************************
#define IOC_PD5_SEL_PD5_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PD5. 
#define IOC_PD5_SEL_PD5_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PD6_SEL register.
//
//*****************************************************************************
#define IOC_PD6_SEL_PD6_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PD6. 
#define IOC_PD6_SEL_PD6_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PD7_SEL register.
//
//*****************************************************************************
#define IOC_PD7_SEL_PD7_sel_M   0x0000001F  // Select one peripheral signal 
                                            // output for PD7. 
#define IOC_PD7_SEL_PD7_sel_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PA0_OVER register.
//
//*****************************************************************************
#define IOC_PA0_OVER_PA0_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PA0_OVER_PA0_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PA1_OVER register.
//
//*****************************************************************************
#define IOC_PA1_OVER_PA1_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PA1_OVER_PA1_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PA2_OVER register.
//
//*****************************************************************************
#define IOC_PA2_OVER_PA2_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PA2_OVER_PA2_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PA3_OVER register.
//
//*****************************************************************************
#define IOC_PA3_OVER_PA3_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PA3_OVER_PA3_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PA4_OVER register.
//
//*****************************************************************************
#define IOC_PA4_OVER_PA4_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PA4_OVER_PA4_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PA5_OVER register.
//
//*****************************************************************************
#define IOC_PA5_OVER_PA5_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PA5_OVER_PA5_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PA6_OVER register.
//
//*****************************************************************************
#define IOC_PA6_OVER_PA6_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PA6_OVER_PA6_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PA7_OVER register.
//
//*****************************************************************************
#define IOC_PA7_OVER_PA7_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PA7_OVER_PA7_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PB0_OVER register.
//
//*****************************************************************************
#define IOC_PB0_OVER_PB0_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PB0_OVER_PB0_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PB1_OVER register.
//
//*****************************************************************************
#define IOC_PB1_OVER_PB1_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PB1_OVER_PB1_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PB2_OVER register.
//
//*****************************************************************************
#define IOC_PB2_OVER_PB2_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PB2_OVER_PB2_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PB3_OVER register.
//
//*****************************************************************************
#define IOC_PB3_OVER_PB3_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PB3_OVER_PB3_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PB4_OVER register.
//
//*****************************************************************************
#define IOC_PB4_OVER_PB4_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PB4_OVER_PB4_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PB5_OVER register.
//
//*****************************************************************************
#define IOC_PB5_OVER_PB5_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PB5_OVER_PB5_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PB6_OVER register.
//
//*****************************************************************************
#define IOC_PB6_OVER_PB6_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PB6_OVER_PB6_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PB7_OVER register.
//
//*****************************************************************************
#define IOC_PB7_OVER_PB7_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PB7_OVER_PB7_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PC0_OVER register.
//
//*****************************************************************************
#define IOC_PC0_OVER_PC0_over   0x00000008  // 0: output disable 1: oe - 
                                            // output enable 
#define IOC_PC0_OVER_PC0_over_M 0x00000008
#define IOC_PC0_OVER_PC0_over_S 3
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PC1_OVER register.
//
//*****************************************************************************
#define IOC_PC1_OVER_PC1_over   0x00000008  // 0: output disable 1: oe - 
                                            // output enable 
#define IOC_PC1_OVER_PC1_over_M 0x00000008
#define IOC_PC1_OVER_PC1_over_S 3
//*****************************************************************************
//
