RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_ioc.h
// The following are defines for the bit fields in the IOC_PC2_OVER register.
//
//*****************************************************************************
#define IOC_PC2_OVER_PC2_over   0x00000008  // 0: output disable 1: oe - 
                                            // output enable 
#define IOC_PC2_OVER_PC2_over_M 0x00000008
#define IOC_PC2_OVER_PC2_over_S 3
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PC3_OVER register.
//
//*****************************************************************************
#define IOC_PC3_OVER_PC3_over   0x00000008  // 0: output disable 1: oe - 
                                            // output enable 
#define IOC_PC3_OVER_PC3_over_M 0x00000008
#define IOC_PC3_OVER_PC3_over_S 3
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PC4_OVER register.
//
//*****************************************************************************
#define IOC_PC4_OVER_PC4_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PC4_OVER_PC4_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PC5_OVER register.
//
//*****************************************************************************
#define IOC_PC5_OVER_PC5_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PC5_OVER_PC5_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PC6_OVER register.
//
//*****************************************************************************
#define IOC_PC6_OVER_PC6_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PC6_OVER_PC6_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PC7_OVER register.
//
//*****************************************************************************
#define IOC_PC7_OVER_PC7_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PC7_OVER_PC7_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PD0_OVER register.
//
//*****************************************************************************
#define IOC_PD0_OVER_PD0_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PD0_OVER_PD0_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PD1_OVER register.
//
//*****************************************************************************
#define IOC_PD1_OVER_PD1_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PD1_OVER_PD1_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PD2_OVER register.
//
//*****************************************************************************
#define IOC_PD2_OVER_PD2_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PD2_OVER_PD2_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PD3_OVER register.
//
//*****************************************************************************
#define IOC_PD3_OVER_PD3_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PD3_OVER_PD3_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PD4_OVER register.
//
//*****************************************************************************
#define IOC_PD4_OVER_PD4_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PD4_OVER_PD4_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PD5_OVER register.
//
//*****************************************************************************
#define IOC_PD5_OVER_PD5_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PD5_OVER_PD5_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PD6_OVER register.
//
//*****************************************************************************
#define IOC_PD6_OVER_PD6_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PD6_OVER_PD6_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_PD7_OVER register.
//
//*****************************************************************************
#define IOC_PD7_OVER_PD7_over_M 0x0000000F  // 0x8: oe - output enable 0x4: 
                                            // pue - pullup enable 0x2: pde - 
                                            // pulldown enable 0x1: ana - 
                                            // analog enable 
#define IOC_PD7_OVER_PD7_over_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// IOC_UARTRXD_UART0 register.
//
//*****************************************************************************
#define IOC_UARTRXD_UART0_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as UART0 RX 1: 
                                            // PA1 selected as UART0 RX ... 31: 
                                            // PD7 selected as UART0 RX 

#define IOC_UARTRXD_UART0_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// IOC_UARTCTS_UART1 register.
//
//*****************************************************************************
#define IOC_UARTCTS_UART1_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as UART1 CTS 1: 
                                            // PA1 selected as UART1 CTS ... 
                                            // 31: PD7 selected as UART1 CTS 

#define IOC_UARTCTS_UART1_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// IOC_UARTRXD_UART1 register.
//
//*****************************************************************************
#define IOC_UARTRXD_UART1_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as UART1 RX 1: 
                                            // PA1 selected as UART1 RX ... 31: 
                                            // PD7 selected as UART1 RX 

#define IOC_UARTRXD_UART1_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// IOC_CLK_SSI_SSI0 register.
//
//*****************************************************************************
#define IOC_CLK_SSI_SSI0_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as SSI0 CLK 1: 
                                            // PA1 selected as SSI0 CLK ... 31: 
                                            // PD7 selected as SSI0 CLK 

#define IOC_CLK_SSI_SSI0_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// IOC_SSIRXD_SSI0 register.
//
//*****************************************************************************
#define IOC_SSIRXD_SSI0_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as SSI0 RX 1: 
                                            // PA1 selected as SSI0 RX ... 31: 
                                            // PD7 selected as SSI0 RX 

