RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_ioc.h
#define IOC_SSIRXD_SSI0_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// IOC_SSIFSSIN_SSI0 register.
//
//*****************************************************************************
#define IOC_SSIFSSIN_SSI0_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as SSI0 FSSIN 
                                            // 1: PA1 selected as SSI0 FSSIN 
                                            // ... 31: PD7 selected as SSI0 
                                            // FSSIN 

#define IOC_SSIFSSIN_SSI0_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// IOC_CLK_SSIIN_SSI0 register.
//
//*****************************************************************************
#define IOC_CLK_SSIIN_SSI0_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as SSI0 
                                            // CLK_SSIN 1: PA1 selected as SSI0 
                                            // CLK_SSIN ... 31: PD7 selected as 
                                            // SSI0 CLK_SSIN 

#define IOC_CLK_SSIIN_SSI0_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// IOC_CLK_SSI_SSI1 register.
//
//*****************************************************************************
#define IOC_CLK_SSI_SSI1_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as SSI1 CLK 1: 
                                            // PA1 selected as SSI1 CLK ... 31: 
                                            // PD7 selected as SSI1 CLK 

#define IOC_CLK_SSI_SSI1_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// IOC_SSIRXD_SSI1 register.
//
//*****************************************************************************
#define IOC_SSIRXD_SSI1_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as SSI1 RX 1: 
                                            // PA1 selected as SSI1 RX ... 31: 
                                            // PD7 selected as SSI1 RX 

#define IOC_SSIRXD_SSI1_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// IOC_SSIFSSIN_SSI1 register.
//
//*****************************************************************************
#define IOC_SSIFSSIN_SSI1_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as SSI1 FSSIN 
                                            // 1: PA1 selected as SSI1 FSSIN 
                                            // ... 31: PD7 selected as SSI1 
                                            // FSSIN 

#define IOC_SSIFSSIN_SSI1_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// IOC_CLK_SSIIN_SSI1 register.
//
//*****************************************************************************
#define IOC_CLK_SSIIN_SSI1_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as SSI1 
                                            // CLK_SSIN 1: PA1 selected as SSI1 
                                            // CLK_SSIN ... 31: PD7 selected as 
                                            // SSI1 CLK_SSIN 

#define IOC_CLK_SSIIN_SSI1_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_I2CMSSDA register.
//
//*****************************************************************************
#define IOC_I2CMSSDA_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as I2C SDA 1: 
                                            // PA1 selected as I2C SDA ... 31: 
                                            // PD7 selected as I2C SDA 

#define IOC_I2CMSSDA_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_I2CMSSCL register.
//
//*****************************************************************************
#define IOC_I2CMSSCL_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as I2C SCL 1: 
                                            // PA1 selected as I2C SCL ... 31: 
                                            // PD7 selected as I2C SCL 

#define IOC_I2CMSSCL_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_GPT0OCP1 register.
//
//*****************************************************************************
#define IOC_GPT0OCP1_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as GPT0OCP1 1: 
                                            // PA1 selected as GPT0OCP1 ... 31: 
                                            // PD7 selected as GPT0OCP1 

#define IOC_GPT0OCP1_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_GPT0OCP2 register.
//
//*****************************************************************************
#define IOC_GPT0OCP2_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as GPT0OCP2 1: 
                                            // PA1 selected as GPT0OCP2 ... 31: 
                                            // PD7 selected as GPT0OCP2 

#define IOC_GPT0OCP2_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_GPT1OCP1 register.
//
//*****************************************************************************
#define IOC_GPT1OCP1_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as GPT1OCP1 1: 
                                            // PA1 selected as GPT1OCP1 ... 31: 
                                            // PD7 selected as GPT1OCP1 

#define IOC_GPT1OCP1_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_GPT1OCP2 register.
//
//*****************************************************************************
#define IOC_GPT1OCP2_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as GPT1OCP2 1: 
                                            // PA1 selected as GPT1OCP2 ... 31: 
                                            // PD7 selected as GPT1OCP2 

#define IOC_GPT1OCP2_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_GPT2OCP1 register.
//
//*****************************************************************************
#define IOC_GPT2OCP1_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as GPT2OCP1 1: 
                                            // PA1 selected as GPT2OCP1 ... 31: 
                                            // PD7 selected as GPT2OCP1 

#define IOC_GPT2OCP1_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_GPT2OCP2 register.
//
//*****************************************************************************
#define IOC_GPT2OCP2_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as GPT2OCP2 1: 
                                            // PA1 selected as GPT2OCP2 ... 31: 
                                            // PD7 selected as GPT2OCP2 

#define IOC_GPT2OCP2_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_GPT3OCP1 register.
//
//*****************************************************************************
#define IOC_GPT3OCP1_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as GPT3OCP1 1: 
                                            // PA1 selected as GPT3OCP1 ... 31: 
                                            // PD7 selected as GPT3OCP1 

#define IOC_GPT3OCP1_INPUT_SEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the IOC_GPT3OCP2 register.
//
//*****************************************************************************
#define IOC_GPT3OCP2_INPUT_SEL_M \
                                0x0000001F  // 0: PA0 selected as GPT3OCP2 1: 
                                            // PA1 selected as GPT3OCP2 ... 31: 
                                            // PD7 selected as GPT3OCP2 

#define IOC_GPT3OCP2_INPUT_SEL_S 0


#endif // __HW_IOC_H__

